//
//  AchievementsManager.swift
//  surdo
//
//  Created by Rustem Orazbayev on 1/27/24.
//

import UIKit

struct AchievementsManager {
    static var achievements: [Int] = [0]
    
    static let achievementTitles = [
        "Начало пути",
        "Новичок Языка Жестов",
        "Азы Алфавита",
        "Ниндзя Чисел",
        "Мастер Приветствий",
        "Повседневный Исследователь",
        "Знаток Цветов",
        "Фанатик Семьи и Друзей",
        "Эмоциональный Экспрессив",
        "Поклонник Ежедневной Ловкости",
        "Мастер Знакового Словаря",
        "Страж Грамматики",
        "Пикассо Фраз",
        "Связь с Культурой",
        "Звезда Рассказчика",
        "Интермедиа Переводчик",
        "Мультиязычный Маэстро",
        "Экспрессивный Экстраординар",
        "Мастер Буквосочетаний",
        "Поддержка Глухого Сообщества",
        "Сенсация Языка Жестов"
    ]

    static let achievementDescriptions = [
        "Продолжайте учебу и начните свой путь в изучении языка жестов!",
        "Завершите свой первый урок по языку жестов.",
        "Овладейте всеми буквами алфавита языка жестов.",
        "Изучите все числа в языке жестов.",
        "Овладейте общими приветствиями и представлениями на языке жестов.",
        "Изучите основные жесты для повседневных действий.",
        "Овладейте жестами для различных цветов.",
        "Изучите жесты для членов семьи и друзей.",
        "Выражайте основные эмоции с помощью языка жестов.",
        "Практикуйте язык жестов ежедневно в течение недели.",
        "Овладейте определенным количеством жестов в языке.",
        "Понимайте и применяйте основные грамматические принципы языка жестов.",
        "Овладейте ключевыми фразами для эффективного общения.",
        "Изучите жесты, связанные с культурными аспектами.",
        "Передавайте короткую историю или повествование с помощью языка жестов.",
        "Завершите набор уроков среднего уровня.",
        "Изучите жесты на нескольких языках.",
        "Выражайте сложные мысли и мнения на языке жестов.",
        "Овладейте буквосочетаниями и распознавайте слова, произнесенные по буквам.",
        "Получите представление о глухом сообществе и его культуре.",
        "Завершите все доступные уроки по языку жестов в приложении."
    ]
}
